# Задача 2. Найдите сумму цифр трехзначного числа n.
# Результат сохраните в перменную res.
# n = 123 -> res = 6 (1 + 2 + 3)
# n = 100 -> res = 1 (1 + 0 + 0)

n = int(input("Введите трехзначное число: "))
sum = 0
while n > 0:
    sum += n % 10
    n = int(n/10)
res = sum
print(res)